# FunctionParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FunctionParam Property
ParameterTypeId Class See Also
---
"Function"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FunctionParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FunctionParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FunctionParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace